public class HW04 {
    public static void main(String[] args) {

        /*Задача №1
Необходимо вывести числа от 0 до 15.
*/for (int i = 1; i <= 15; i = i + 1){
            System.out.println(i);
        }

/*Задача №2
Необходимо вывести все положительные степени числа
5 которые меньше 10000, вывести результат возведения в степень.
 */


/*Задача №3
Необходимо вывести все числа кратные 4 между числами 40 и 60 включительно.
Реализовать 2 варианта:
1) использовать конструкцию if для определения кратности (цикл с шагом 1, i = i + 1);
2) без использования конструкции if (шаг цикла на ваше усмотрение).
*/



    }
}
